EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_IR/encoder.c
/*
  Copyright BlueBird Aero Systems Engineering Ltd 2012

  $Id: Encoder.c,v 1.1 2012/07/14 07:19:48 EranS Exp $
  $Log: Encoder.c,v $

  Revision 1.1  2011/03/15 12:23:45  EranS
  First save

  Bluebird Stabilized Platform
*/
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "inc/lm4f230h5qr.h"
#include "driverlib/gpio.h"
#include "driverlib/qei.h"
#include "driverlib/rom.h"
#include "driverlib/sysctl.h"
#include "driverlib/pin_map.h"
#include "driverlib/systick.h"
#include "driverlib/interrupt.h"
#include "constants.h"
#include "encoder.h"
#include "pins.h"
#include "A3906.h"
#include "rmb20d01.h"


#define INIT_POS_123 (0)
#define MAX_POSITION 9999

extern unsigned long ulPeriod;
unsigned long g_ulminrollpos,g_ulmaxrollpos;
unsigned long g_ulminpitchpos,g_ulmaxpitchpos;

unsigned long g_ulqei0pos_left,g_ulqei0pos_right;
unsigned long g_ulqei1pos_left,g_ulqei1pos_right;

//*****************************************************************************
//
// The number of lines in the attached quadrature encoder.
//
//*****************************************************************************
static unsigned long g_ulEncoderLines = 0;
static unsigned long g_ulEncoder1Lines = 0;

//*****************************************************************************
//
// The time at which the previous encoder edge occurred.
//
//*****************************************************************************
static unsigned long g_ulEncoderPrevious;
static unsigned long g_ulEncoder1Previous;

//*****************************************************************************
//
// The number of system clocks between edges from the encoder.
//
//*****************************************************************************
static unsigned long g_ulEncoderClocks;
static unsigned long g_ulEncoder1Clocks;

//*****************************************************************************
//
// The number of ticks until the encoder (and therefore motor) is assumed to
// have stopped.
//
//*****************************************************************************
static unsigned short g_usEncoderCount;
static unsigned short g_usEncoder1Count;

static unsigned long EncoderCount = 0;
//static unsigned long Encoder1Count = 0;

extern volatile unsigned long g_ulTickCount;

static unsigned short g_usEncoderFlags;
static unsigned short g_usEncoder1Flags;

//***************************************************************************** 
 //----------VARIABLES 
 //***************************************************************************** 
  unsigned long status2, status1; 
  unsigned long status4, status3; 
 
//***************************************************************************** 
//----------VARIABLES 
//***************************************************************************** 
static unsigned long ulstatus;
static unsigned long ulstatus1;

unsigned long pultemp[10]; 
unsigned char uctemp[4]; 
unsigned long ulCurrent_Position; 

unsigned long pultemp1[10]; 
unsigned char uctemp1[4]; 
unsigned long ulCurrent_Position1; 

void MotorBrakePositionSet(enum MOTOR motor,unsigned long point);
void MotorBrakePositionClean(enum MOTOR motor);
int MotorPositionError(enum MOTOR motor);

//*****************************************************************************
//
// Sets the H-bridge brake/coast configuration.
//
//*****************************************************************************
void
MotorBrakePositionSet(enum MOTOR motor,unsigned long point)
{
    //
    // Set the stow position point.  This will be applied on the
    //	
    if(motor == PITCH_MOTOR)
    {
		Motor[motor].stowpoint = point;
		HWREGBITH(&g_usEncoderFlags, ENCODER_FLAG_PITCH) = 1;
    }
	else
	{
		Motor[motor].stowpoint = point;
		HWREGBITH(&g_usEncoderFlags, ENCODER_FLAG_ROLL) = 1;
	}
}

//*****************************************************************************
//
// Gets the H-bridge brake/coast configuration.
//
//*****************************************************************************
void
MotorBrakePositionClean(enum MOTOR motor)
{
    //
    // Clean the stow/pilot status.
    //	
    if(motor == PITCH_MOTOR)
		HWREGBITH(&g_usEncoderFlags, ENCODER_FLAG_PITCH) = 0;
	else
		HWREGBITH(&g_usEncoderFlags, ENCODER_FLAG_ROLL) = 0;

}

//*****************************************************************************
//
// Gets the H-bridge brake/coast configuration.
//
//*****************************************************************************
int
MotorPositionError(enum MOTOR motor)
{
    //
    // Clean the stow/pilot status.
    //	
    if(motor == PITCH_MOTOR)
    {
		if(HWREGBITH(&g_usEncoderFlags, ENCODER_FLAG_EDGE_FUALSE) == 1)		
			return -1;			
    }
	else
	{
		if(HWREGBITH(&g_usEncoder1Flags, ENCODER_FLAG_EDGE_FUALSE) == 1)		
			return -1;
	}

	return 0;
}

/*
  Move motor until no more change in encoder value, which
  we assume to mean that the gimbal is at its extreme point.
  Reset the appropriate encoder
*/
unsigned long prevenc;
void EncoderInitReset(unsigned long ulBase,enum MOTOR motor,enum A3906Logic logic)
{
	  unsigned long start;
	  tBoolean encChanged;
	  start = g_ulTickCount;
	  // move until encoders show no change
	  encChanged = true;
	  prevenc = QEIPositionGet(ulBase);
	  GeneralPitchRoll(motor,logic,motor == PITCH_MOTOR ? ((ulPeriod*30)/100): ((ulPeriod*40)/100));	  
	  while(encChanged)
	  {
		while ((g_ulTickCount - start) < 1000);   // encoder samples at 500Hz, we check at 10Hz
		encChanged = (prevenc != QEIPositionGet(ulBase));
		prevenc = QEIPositionGet(ulBase);
		start = g_ulTickCount;
	  }
	  
	  GeneralPitchRoll(motor,A3906_BRAKE,ulPeriod);
	  
	  if(ulBase == QEI0_BASE) // PITCH_MOTOR
	  {
		  if(logic == A3906_FORWARD)
		  {
			  //
			  // Indicate that an full edge has been seen.
			  //

			  //Motor[motor].max_position = QEIPositionGet(QEI0_BASE);
			  //Motor[motor].avg_position = QEIPositionGet(QEI0_BASE)/2;
			  
		  	  if( QEIPositionGet(QEI0_BASE) > FULL_SCALE_PITCH_MOTOR)
			    HWREGBITH(&g_usEncoderFlags, ENCODER_FLAG_EDGE_FUALSE) = 0;
			  else
				  HWREGBITH(&g_usEncoderFlags, ENCODER_FLAG_EDGE_FUALSE) = 1;
			  				  
