EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_IR/encoder.c
		  }
		  else
		  {
			  QEIPositionSet(ulBase, 0);
			  Motor[motor].min_position = 1000;			  
			  Motor[motor].max_position = 120000;			  
			  Motor[motor].relative = 45263;
			  HWREGBITH(&g_usEncoderFlags, ENCODER_FLAG_EDGE_FUALSE) = 0;
			  
			  
		  }
	  }
	  else					//	ROLL_MOTOR
	  {
		  if(logic == A3906_FORWARD)
		  {
		  
			  QEIPositionSet(ulBase, 0);
			  Motor[motor].min_position = 315500;			  
			  Motor[motor].max_position = 156000;
			  Motor[motor].relative = 230770;			  
  			  HWREGBITH(&g_usEncoder1Flags, ENCODER_FLAG_EDGE_FUALSE) = 0;
			  
		  }
		  else
		  {
			  //Motor[motor].max_position = QEIPositionGet(QEI1_BASE);							  
			  //Motor[motor].avg_position = (QEIPositionGet(QEI1_BASE)/2)+5500;	// Fix symmetry 							  

			  if( QEIPositionGet(QEI1_BASE) < FULL_SCALE_ROLL_MOTOR)
				HWREGBITH(&g_usEncoder1Flags, ENCODER_FLAG_EDGE_FUALSE) = 1;
			  else
				  HWREGBITH(&g_usEncoder1Flags, ENCODER_FLAG_EDGE_FUALSE) = 0;
			  
		  }
	
	  }

}



void EncoderInit2Point(enum MOTOR motor,enum A3906Logic driction,unsigned long point)
{

  unsigned long ulpos;  
  //tContext sContext;
  unsigned long ulBase = (motor == PITCH_MOTOR ? QEI0_BASE : QEI1_BASE);

  //
  // Save the time.
  //
  ulpos = QEIPositionGet(ulBase);
  
  if(ulpos > point)
	  GeneralPitchRoll(motor,A3906_REVERSE,((ulPeriod*25)/100));
  else		
  if(ulpos < point)	
	  GeneralPitchRoll(motor,A3906_FORWARD,((ulPeriod*25)/100));

  MotorBrakePositionSet(motor,point);
  	
}

#if 0
void EncoderWhile2Point(enum MOTOR motor,enum A3906Logic driction,unsigned long point)
{

  unsigned long ulpos;  
  //tContext sContext;
  unsigned long ulBase = (motor == PITCH_MOTOR ? QEI0_BASE : QEI1_BASE);

  //
  // Save the time.
  //
  ulpos = QEIPositionGet(ulBase);
  
  if(ulpos > point)
	  GeneralPitchRoll(motor,A3906_REVERSE,30);
  else		
  if(ulpos < point)	
	  GeneralPitchRoll(motor,A3906_FORWARD,30);

  //MotorBrakePositionSet(motor,point);
  
  while(ulpos != point)
	  ulpos = QEIPositionGet(ulBase);	  
    
  GeneralPitchRoll(motor,A3906_BRAKE,99);
  QEIPositionSet(ulBase, 0);
  
}


#else
void EncoderWhile2Point(enum MOTOR motor,enum A3906Logic driction,unsigned long point)
{

  unsigned long ulpos;  
  //tContext sContext;
  unsigned long ulBase = (motor == PITCH_MOTOR ? QEI0_BASE : QEI1_BASE);

  //
  // Save the time.
  //
  ulpos = QEIPositionGet(ulBase);
  
  if(ulpos > point)
	  GeneralPitchRoll(motor,A3906_REVERSE,((ulPeriod*30)/100));
  else		
  if(ulpos < point)	
	  GeneralPitchRoll(motor,A3906_FORWARD,((ulPeriod*30)/100));

  //MotorBrakePositionSet(motor,point);
  
  while(ulpos != point)
  {
	ulpos = QEIPositionGet(ulBase);	  

	if((ulpos > point))
		GeneralPitchRoll(motor,A3906_REVERSE,((ulPeriod*30)/100));				
	else	  
	if((ulpos < point))			  
		GeneralPitchRoll(motor,A3906_FORWARD,((ulPeriod*30)/100));
  }
  
  GeneralPitchRoll(motor,A3906_BRAKE,ulPeriod);
  //QEIPositionSet(ulBase, 0);
  
}
#endif
//*****************************************************************************
//
// This function is called to handle the GPIO edge interrupt from the
// quadrature encoder.
//
//*****************************************************************************
void
QEI0IntHandler(void)
{
    unsigned long ulNow;

    //
    // Save the time.
    //
    ulNow = SysTickValueGet();

    //
    // Clear the encoder interrupt.
    //
    GPIOPinIntClear(QEI_PITCH_PHA_PORT, QEI_PITCH_PHA_PIN);

	ulstatus = QEIIntStatus(QEI0_BASE,false); 
	if (  (ulstatus & QEI_INTDIR) == QEI_INTDIR) 
	{ 
	  // 
	  // clear	Interrupt Bit	 
	   QEIIntClear(QEI0_BASE, QEI_INTDIR); 
	  // 
	  //code for Direction change 
	  //.............. 
	} 
	if (  (ulstatus & QEI_INTINDEX) == QEI_INTINDEX) 
	{ 
	  // 
	  // clear	Interrupt Bit	 
	   QEIIntClear(QEI0_BASE, QEI_INTINDEX); 
	  // 
	  //code for Index change 
	  //.............. 
	}		
	if (  (ulstatus & QEI_INTERROR) == QEI_INTERROR) 
	{ 
	  //	 
	  // clear	Interrupt Bit	 
		QEIIntClear(QEI0_BASE, QEI_INTERROR); 
	  // 
	  //code for Phase ERROR 
	  //.............. 
	} 

    //
    // Determine the number of system clocks between the previous edge and this
    // edge.
    //
    if(g_ulEncoderPrevious > ulNow)
    {
        g_ulEncoderClocks = g_ulEncoderPrevious - ulNow;
    }
    else
    {
        g_ulEncoderClocks = (SYSCLK_50MHZ - ulNow) + g_ulEncoderPrevious;		
		
    }

    //
    // Save the time of the current edge as the time of the previous edge.
    //
    g_ulEncoderPrevious = ulNow;

    //
    // Indicate that an edge has been seen.
    //
    HWREGBITH(&g_usEncoderFlags, ENCODER_FLAG_EDGE) = 1;

    //
    // If the previous edge time was valid, then indicate that the time between
    // edges is also now valid.
    //
    if(HWREGBITH(&g_usEncoderFlags, ENCODER_FLAG_PREVIOUS) == 1)
    {
        HWREGBITH(&g_usEncoderFlags, ENCODER_FLAG_VALID) = 1;
    }

    //
    // Indicate that the previous edge time is valid.
    //
    HWREGBITH(&g_usEncoderFlags, ENCODER_FLAG_PREVIOUS) = 1;
}

//*****************************************************************************
//
// This function is called to handle the GPIO edge interrupt from the
// quadrature encoder.
//
//*****************************************************************************
void
QEI1IntHandler(void)
{
    unsigned long ulNow;

    //
    // Save the time.
    //
    ulNow = SysTickValueGet();

    //
    // Clear the encoder interrupt.
    //
    GPIOPinIntClear(QEI_ROLL_PHA_PORT, QEI_ROLL_PHA_PIN);

	ulstatus1 = QEIIntStatus(QEI1_BASE,false); 
	if (  (ulstatus1 & QEI_INTDIR) == QEI_INTDIR) 
	{ 
	  // 
	  // clear	Interrupt Bit	 
	   QEIIntClear(QEI1_BASE, QEI_INTDIR); 
	  // 
	  //code for Direction change 
	  //.............. 
	} 
	if (  (ulstatus1 & QEI_INTINDEX) == QEI_INTINDEX) 
	{ 
	  // 
	  // clear	Interrupt Bit	 
	   QEIIntClear(QEI1_BASE, QEI_INTINDEX); 
	  // 
	  //code for Index change 
	  //.............. 
	}		
	if (  (ulstatus1 & QEI_INTERROR) == QEI_INTERROR) 
	{ 
	  //	 
	  // clear	Interrupt Bit	 
		QEIIntClear(QEI1_BASE, QEI_INTERROR); 
	  // 
	  //code for Phase ERROR 
	  //.............. 
	} 

    //
    // Determine the number of system clocks between the previous edge and this
    // edge.
    //
    if(g_ulEncoder1Previous > ulNow)
    {
        g_ulEncoder1Clocks = g_ulEncoder1Previous - ulNow;
    }
    else
    {
        g_ulEncoder1Clocks = (SYSCLK_50MHZ - ulNow) + g_ulEncoder1Previous;		
		
