EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_IR/encoder.c
		}
		
		
	}
	else
	if(ulBase == QEI1_BASE)
	{
		#if 0
		//
		// See if an edge has been seen since the last call.
		//
		if(HWREGBITH(&g_usEncoder1Flags, ENCODER_FLAG_EDGE) == 1)
		{
			//
			// Clear the edge flag.
			//
			HWREGBITH(&g_usEncoder1Flags, ENCODER_FLAG_EDGE) = 0;
		
			//
			// Reset the delay counter.
			//
			g_usEncoder1Count = ENCODER_WAIT_TIME;

		}
		
		//
		// Otherwise, see if the delay counter is still active.
		//
		else if(g_usEncoder1Count != 0)
		{
			//
			// Decrement the delay counter.
			//
			g_usEncoder1Count--;
		
			//
			// If the delay counter has reached zero, then indicate that there are
			// no valid speed values from the encoder.
			//
			if(g_usEncoder1Count == 0)
			{
				HWREGBITH(&g_usEncoder1Flags, ENCODER_FLAG_PREVIOUS) = 0;
				HWREGBITH(&g_usEncoder1Flags, ENCODER_FLAG_VALID) = 0;
			}
		}
		#endif

		Motor[ROLL_MOTOR].position = QEIPositionGet(QEI1_BASE);
		Motor[ROLL_MOTOR].direction= QEIDirectionGet(QEI1_BASE);
		Motor[ROLL_MOTOR].aangle= ((Motor[ROLL_MOTOR].position - Motor[ROLL_MOTOR].zero_pos) / 924.444f);	// 180

	
		//
		// If the previous edge time was valid, then indicate that the time between
		// edges is also now valid.
		//
		if(HWREGBITH(&g_usEncoderFlags, ENCODER_FLAG_ROLL) == 1)
		{
			if(QEIPositionGet(QEI1_BASE) == Motor[ROLL_MOTOR].stowpoint)	  
			{
				GeneralPitchRoll(ROLL_MOTOR,A3906_BRAKE,ulPeriod);	
				HWREGBITH(&g_usEncoderFlags, ENCODER_FLAG_ROLL) = 0;
			}
			else
			if((QEIPositionGet(QEI1_BASE) < Motor[ROLL_MOTOR].stowpoint))
				GeneralPitchRoll(ROLL_MOTOR,A3906_FORWARD,((ulPeriod*25)/100));				
			else	  
			if((QEIPositionGet(QEI1_BASE) > Motor[ROLL_MOTOR].stowpoint))			  
				GeneralPitchRoll(ROLL_MOTOR,A3906_REVERSE,((ulPeriod*25)/100));				
			
		}			

	}
}

//*****************************************************************************
//
// This function sets the number of lines in the attached encoder.
//
//*****************************************************************************
void
EncoderLinesSet(unsigned long ulBase,unsigned long ulLines)
{
    //
    // Save the number of lines in the encoder.
    //
    if(ulBase == QEI0_BASE)
	    g_ulEncoderLines = ulLines;
	else
	if(ulBase == QEI1_BASE)
		g_ulEncoder1Lines = ulLines;
		
}

//*****************************************************************************
//
// This function gets the number of lines in the attached encoder.
//
//*****************************************************************************
unsigned long
EncoderLinesGet(void)
{
    //
    // Return the number of lines in the encoder.
    //
    return(g_ulEncoderLines);
}

//*****************************************************************************
//
// This function ``sets'' the position of the encoder.  This is the position
// against which all further movements of the encoder are measured in a
// relative sense.
//
//*****************************************************************************
void
EncoderPositionSet(long lPosition)
{
    //
    // Convert the position into the number of encoder lines.
    //
    //lPosition = MathMul16x16(lPosition, g_ulEncoderLines * 4);
	lPosition = lPosition*( g_ulEncoderLines * 4);

    //
    // Set the encoder position in the quadrature encoder module.
    //
    QEIPositionSet(QEI0_BASE, lPosition);
}

//*****************************************************************************
//
// This function ``sets'' the position of the encoder.  This is the position
// against which all further movements of the encoder are measured in a
// relative sense.
//
//*****************************************************************************
void
Encoder1PositionSet(long lPosition)
{
    //
    // Convert the position into the number of encoder lines.
    //
    //lPosition = MathMul16x16(lPosition, g_ulEncoderLines * 4);
	lPosition = lPosition*( g_ulEncoder1Lines * 4);

    //
    // Set the encoder position in the quadrature encoder module.
    //
    QEIPositionSet(QEI1_BASE, lPosition);
}

//*****************************************************************************
//
// Gets the current position of the encoder, specified as a signed 16.16 fixed-
// point value that represents a number of full revolutions.
//
//*****************************************************************************
float
EncoderPositionGet(unsigned long ulBase)
{
    //
    // Convert the encoder position to a number of revolutions and return it.
    //
    //return(MathDiv16x16(QEIPositionGet(QEI0_BASE), g_ulEncoderLines * 4));
    return(QEIPositionGet(ulBase)/ (g_ulEncoderLines * 4));
	
}

//*****************************************************************************
//
// Gets the current position of the encoder, specified as a signed 16.16 fixed-
// point value that represents a number of full revolutions.
//
//*****************************************************************************
float
Encoder1PositionGet(void)
{
    //
    // Convert the encoder position to a number of revolutions and return it.
    //
    //return(MathDiv16x16(QEIPositionGet(QEI0_BASE), g_ulEncoderLines * 4));
    return(QEIPositionGet(QEI1_BASE)/ (g_ulEncoder1Lines * 4));
	
}

//*****************************************************************************
//
// Gets the current position of the encoder, return
// angle value that represents a number of full revolutions.
//
//*****************************************************************************
float
EncoderDegPositionGet(unsigned long ulBase)
{
    //
    // Convert the encoder position to a degrees of revolutions and return it.
    //
    return( QEIPositionGet(ulBase)/ 462.222f);	
}

#if 1
//*****************************************************************************
//
// Gets the current speed of the encoder, specified as an unsigned 16.16 fixed-
// point value that represents the speed in revolutions per minute (RPM).
//
//*****************************************************************************
long
EncoderVelocityGet(long lSigned)
{
    //
    // If the time between edges is not valid, then the speed is zero.
    //
    if(HWREGBITH(&g_usEncoderFlags, ENCODER_FLAG_VALID) == 0)
    {
        return(0);
    }

    //
    // Convert the time between edges into a speed in RPM and return it.
    //
    //return(MathDiv16x16(SYSCLK * 60, g_ulEncoderClocks * g_ulEncoderLines));
	return( (SYSCLK * 60) / (g_ulEncoderClocks * g_ulEncoderLines));
}

//*****************************************************************************
//
// Gets the current speed of the encoder, specified as an unsigned 16.16 fixed-
// point value that represents the speed in revolutions per minute (RPM).
//
//*****************************************************************************
long
Encoder1VelocityGet(long lSigned)
{
    //
    // If the time between edges is not valid, then the speed is zero.
    //
    if(HWREGBITH(&g_usEncoder1Flags, ENCODER_FLAG_VALID) == 0)
    {
        return(0);
    }

    //
    // Convert the time between edges into a speed in RPM and return it.
    //
    //return(MathDiv16x16(SYSCLK * 60, g_ulEncoderClocks * g_ulEncoderLines));
	return( (SYSCLK * 60) / (g_ulEncoder1Clocks * g_ulEncoder1Lines));
}

#else
//*****************************************************************************
//
// Gets the current speed of the encoder, specified as an unsigned 16.16 fixed-
// point value that represents the speed in revolutions per minute (RPM).
//
//*****************************************************************************
long
EncoderVelocityGet(long lSigned)
{
    long lDir;

    //
    // If the time between edges is not valid, then the speed is zero.
    //
    if(HWREGBITH(&g_usEncoderFlags, ENCODER_FLAG_VALID) == 0)
    {
        return(0);
    }

    //
    // See if a signed velocity should be returned.
    //
    if(lSigned)
    {
        //
        // Get the current direction from the QEI module.
        //
        lDir = QEIDirectionGet(QEI0_BASE);
    }
    else
    {
        //
        // An unsigned velocity is requested, so assume the direction is
        // positive.
        //
        lDir = 1;
    }

    //
    // Convert the time between edges into a speed in RPM and return it.
    //
	return( (lDir * SYSCLK * 60) / (g_ulEncoderClocks * g_ulEncoderLines));
}

#endif

//*****************************************************************************
//
// Gets the current position of the encoder, specified as a signed 16.16 fixed-
// point value that represents a number of full revolutions.
//
//*****************************************************************************
unsigned long
EncoderCountSet(unsigned long count)
{
    //
    // Convert the encoder position to a number of revolutions and return it.
    //
    return EncoderCount = count;
}

//*****************************************************************************
//
// Gets the current position of the encoder, specified as a signed 16.16 fixed-
// point value that represents a number of full revolutions.
//
//*****************************************************************************
unsigned long
EncoderCountGet(void)
{
    //
    // Convert the encoder position to a number of revolutions and return it.
    //
    return EncoderCount/64;
}


